{"totalArticles":175356,"articles":[{"title":"Ireland weather: Met Eireann forecast urgent warning for three counties but change expected","description":"A Status Yellow alert is in place","content":"Want the latest news headlines to your inbox every single day? Sign up to our FREE newsletter to make sure you don't miss a beat Invalid Email Something went wrong, please try again later. Sign up! Thank you for subscribing We have more newsletters S... [3257 chars]","url":"https://www.irishmirror.ie/news/irish-news/ireland-weather-met-eireann-forecast-24713782","image":"https://i2-prod.irishmirror.ie/news/irish-news/article23787803.ece/ALTERNATES/s1200/0_CC-Rain-Dublin01290488046.jpg","publishedAt":"2021-08-08T10:54:38Z","source":{"name":"Irish Mirror","url":"https://www.irishmirror.ie"}},{"title":"Schools, colleges in Sindh to remain closed till Aug 19: Sindh education minister","description":"Says vaccinations will be mandatory for teachers; outlines three-fold approach to reforms in education sector.","content":"Sindh Education Minister Syed Sardar Ali Shah said on Sunday that schools and colleges will remain closed till August 19 in view of the rising incidence of coronavirus cases.\nAddressing a press conference in Karachi, he said: \"The decision has been t... [2887 chars]","url":"https://www.dawn.com/news/1639489","image":"https://i.dawn.com/large/2021/08/610fad622b08f.jpg","publishedAt":"2021-08-08T10:43:41Z","source":{"name":"DAWN.com","url":"https://www.dawn.com"}},{"title":"Your Nvidia RTX GPU doesn’t just play games - it helps you make them too","description":"Nvidia RTX graphics cards can be optimized for better results across a host of powerful applications used through the gaming industry.","content":"You love video games, right? That’s likely the reason you have a gaming-optimized graphics card after all, or are at least in the market for one. It’s been a rocky few months for anyone trying to buy a GeForce RTX 30 series GPU given that this second... [7257 chars]","url":"https://www.techradar.com/in/news/your-nvidia-rtx-gpu-doesnt-just-play-games-it-helps-you-make-them-too","image":"https://cdn.mos.cms.futurecdn.net/bc6EGtACsoiAR8mvfJ8dxX-1200-80.jpg","publishedAt":"2021-08-08T10:30:24Z","source":{"name":"Techradar","url":"https://www.techradar.com"}},{"title":"NASA Is Paying People to Live in 3D-Printed Martian Habitat for a Year","description":"NASA is looking for participants to spend a year living in Mars Dune Alpha, a Texas-based facility designed to look and feel like the Red Planet.","content":"NASA is looking for volunteers to live on a fake Martian surface for 12 months.\nThe analog mission will take place inside the Johnson Space Center, in Texas.\nApplicants must be aged between 30-35 and in good physical health.\nInsider Healthcare: The l... [2080 chars]","url":"https://www.businessinsider.com/nasa-mars-3d-printed-martian-habitat-paid-volunteers-space-2021-8","image":"https://i.insider.com/610f99ea2a24d0001862493d?width=1200&format=jpeg","publishedAt":"2021-08-08T10:19:45Z","source":{"name":"Business Insider","url":"https://www.businessinsider.com"}},{"title":"'We challenge you': Congress to Twitter over Rahul Gandhi's locked account","description":"The Congress party also tweeted the photograph of Rahul Gandhi meeting the family of the nine-year-old Dalit girl, who died after being raped by a priest and three other men at a crematorium near Delhi Cantonment. | Latest News India","content":"The Congress on Sunday dared Twitter India to lock its accounts, a day after the social media company locked party leader Rahul Gandhi's handle over a post of his meeting the family of a nine-year-old Dalit girl, who died after an alleged sexual assa... [2289 chars]","url":"https://www.hindustantimes.com/india-news/we-challenge-you-congress-to-twitter-over-rahul-gandhi-s-locked-account-101628417179901.html","image":"https://images.hindustantimes.com/img/2021/08/08/1600x900/Congress_Twitter_Rahul_Gandhi_1628417358854_1628417395055.jpg","publishedAt":"2021-08-08T10:16:12Z","source":{"name":"Hindustan Times","url":"https://www.hindustantimes.com"}},{"title":"Pakistan rejects 'baseless Indian allegations of infiltration' across Line of Control","description":"\"India must refrain from peddling falsehoods and creating pretexts for false flag operations,\" says FO spokesperson.","content":"Foreign Office spokesperson Zahid Hafeez Chaudhri on Sunday rejected reports published by Indian media which quoted an Indian official as saying that \"terrorists are waiting at launch pads to infiltrate\" into occupied Kashmir from Pakistan.\n\"We categ... [2899 chars]","url":"https://www.dawn.com/news/1639487","image":"https://i.dawn.com/large/2021/08/610fa2cf7889d.png","publishedAt":"2021-08-08T10:08:56Z","source":{"name":"DAWN.com","url":"https://www.dawn.com"}},{"title":"Meteor shower to light up Southwestern Ontario skies","description":"Your Local News Network serving London, Windsor, Chatham, Sarnia and Midwestern Ontario","content":"Image of Perseids (Photo via Pierre Martin)\nShare via: Facebook\nTwitter\nLinkedIn\nMore\nStargazers will be able to enjoy the annual Perseid meteor shower as it is set to flare across the night sky this week.\nThe Perseid meteor shower will peak on Wedne... [1255 chars]","url":"https://blackburnnews.com/chatham/chatham-news/2021/08/08/meteor-shower-light-southwestern-ontario-skies/","image":"https://blackburnnews.com/wp-content/uploads/2021/08/Perseids_Pierre-400x250.jpeg","publishedAt":"2021-08-08T10:05:00Z","source":{"name":"BlackburnNews.com","url":"https://blackburnnews.com"}},{"title":"73 new locally transmitted Covid-19 cases in Singapore, including 21 unlinked","description":"Of the new cases, 43 were linked to previous infections and had already been quarantined.. Read more at straitstimes.com.","content":"SINGAPORE - There were 73 new locally transmitted coronavirus cases reported as at noon on Sunday (Aug 8). This is the lowest daily figure since July 17, when there were 60 locally transmitted cases.\nOf the new cases, 43 were linked to previous infec... [1133 chars]","url":"https://www.straitstimes.com/singapore/73-new-locally-transmitted-covid-19-cases-in-singapore-including-21-unlinked","image":"https://www.straitstimes.com/s3/files/styles/x_large/public/articles/2021/08/08/ctmoh0808.jpg?itok=WsQ8HdTS","publishedAt":"2021-08-08T09:59:57Z","source":{"name":"The Straits Times","url":"https://www.straitstimes.com"}},{"title":"In a first, ITBP inducts two women officers in combat","description":"The two women officers -- Prakriti and Diksha -- will be posted as company commanders in ITBP battalions","content":"In a first, the India-China LAC guarding the Indo-Tibetan Border Police force ( ITBP ) today commissioned its first two women officers in combat after they completed their training in Mussoorie.\nThe two women officers -- Prakriti and Diksha -- will b... [3419 chars]","url":"https://www.livemint.com/news/india/in-a-first-itbp-inducts-two-women-officers-in-combat-11628415445957.html","image":"https://images.livemint.com/img/2021/08/08/600x338/itbp_1628416216627_1628416225343.jpg","publishedAt":"2021-08-08T09:53:14Z","source":{"name":"Mint","url":"https://www.livemint.com"}},{"title":"Ex-magistrate Rodney Higgins breaks silence on relationship with court clerk","description":"The retired magistrate, in an interview with A Current Affair, says he deserves a portion of Ashleigh Petrie’s superannuation benefit.","content":"Former Victorian magistrate Rodney Higgins has broken his silence about his relationship with a court clerk 45 years his junior, saying he deserves a portion of her superannuation death benefit.\nMr Higgins, who retired recently, claimed in an intervi... [501 chars]","url":"https://www.theage.com.au/national/victoria/ex-magistrate-rodney-higgins-breaks-silence-on-relationship-with-court-clerk-20210808-p58gvq.html","image":"https://static.ffx.io/images/$zoom_2.2389006342494713%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/8d0963155a948cfda991bc86563bd702ee739be7","publishedAt":"2021-08-08T09:34:44Z","source":{"name":"The Age","url":"https://www.theage.com.au"}}]}